.data  0000					#数据定义的首地址
	NUM1  	.word 0x00000055          		  
	NUM2  	.word 0x000000AA       			
	NUM3  	.word 0x00000000    			
			      			#代码段定义开始
.text	 0000					#代码开始的首地址
start:
	lui   $1,0xFFFF				#让$28为0xFFFF0000作为端口地址的高16位   3C01FFFF
	ori   $28,$1,0xF000			#高20位都为1				 343CF000
	sw	$1, %lo(NUM3)($0)		#8C020408
	lw	$2, %lo(NUM2)($0)		##8C030404
	lui	$1, %hi(NUM1)			#3C010000

k1:	lw $2,NUM1($0)				#8C020400
	lw $3,NUM2($0)				#8C030404
	add $1,$2,$3				#00430820
	sw $1,NUM3($0)				#AC010408
	subu $4,$3,$2				#00622023 
	slt $4,$2,$1				#小于置1 0041202A	
						#按位逻辑运算	
	and $1,$3,$7				# 00670824
	or $6,$2,$1				# 00413025  10 
	xor $7,$2,$3				# 00433826
	nor $6,$5,$1				# 00A13027
	beq $3,$2,-4				#相等转移  1043 FFFC

gh:	sub $2,$2,$5  				#00451022
	sw  $2, 0xC50($28)				#喂看门狗 AF820C50
	bne $5,$2,gh					#不相等转移 1445FFFD
	beq $1,$1,ty					#相等转移 1021 0001  

	nop				#00000000

ty:	jal jj						#过程调用   0C000014
	j mm						#无条件调用 08000015   20
jj:	jr $31				#按寄存器内容转移指令 #03E00008

mm:	addi $2,$0,0x99					#20020099
	ori $3,$0,0x77					#34030077
	sll $3,$2,4					#逻辑左移指令 00021900
	srl $3,$2,4					#逻辑右移指令 00021902
	srlv $3,$2,$1					#按寄存器值逻辑右移指令   00411806
	lui $6,0x9988					#立即数赋值指令（高16位） 3C069988	
	sra $7,$6,4					#算术右移指令 00063903
	addi $2,$0,0					#20020000
	sw   $2, 0xC50($28)				#喂看门狗 AF820C50   30
	addi $3,$0,2					#20030002
	sub  $1,$2,$3					#00430822
	j k1						#08000402    33
.text 0xFFF8	
	jr  $26						#03400008
.text 0xFFFC	
	jr  $27						#03600008